01_Dummy_cases/01_Dynamic_mesh/dynamicMeshWakeGenerator/dynamicMeshWakeGenerator/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    "(walls_rotor|nonCoupleIn2|nonCoupleOut1)"
    {
        type            fixedFluxPressure;
    }

    "(walls_igv|walls_stator)"
    {
        type            zeroGradient;
    }


    "(nonCoupleIn1|nonCoupleOut2)"    //Parts of static domain
    {
        type            zeroGradient;
    }

}

// ************************************************************************* //
